Revit 2027 API
ParameterTypeId.PhyMaterialParamType Property
 "Material Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PhyMaterialParamType { get; }
Public Shared ReadOnly Property PhyMaterialParamType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PhyMaterialParamType {
	ForgeTypeId^ get ();
}
static member PhyMaterialParamType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace